{"columns": ["Samples"], "data": [["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would eat it."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the yogurt. She took the dish. He was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. If she ate it, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the fork! However, he was embarrassed."], ["Jim had to eat the dish. He took the plate. He ate the fork. She ate the cereal. She took the fork and ate the dessert. Instead of eating the dish, she ate it."], ["Sam took the plate. He ate the cereal. He took the fork. She ate the fork and ate it. She took the dish. However, she ate the dessert."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. If she ate it, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the dessert. Instead, she ate the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the yogurt. She took the food. She was embarrassed."], ["Jim took the plate. He ate the cereal. He took the fork. He used the fork to eat. She ate the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the yogurt. She took the plate. However, she ate the dish."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the fork instead."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. They needed to take the fork and eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the plate. She ate the cereal. She forgot to eat it. In addition, she ate the food."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. According to the recipe, Jim was embarrassed."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Dan was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the yogurt. She took the dish. He was embarrassed."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the dish. He took the fork. He ate the fork and ate the cereal. Jim ate the plate. She ate the food. Instead of eating the dish, she ate it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. They ate it."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. They needed to take the fork and eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she forgot to eat it."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she ate the dessert."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Tom asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. When she ate the fork, she was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the dessert. Instead, she ate the food."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. She forgot to eat."], ["Jim tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. If she ate the plate, she would eat it."], ["Dan was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. He didn't eat the fork anymore."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she refused to eat it."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the fork and ate it. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. He was embarrassed."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. They needed to take the fork again."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They ate it."], ["Jim tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. He used the fork to eat. However, he was embarrassed."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she ate the dessert."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They needed to eat the dessert."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. If she ate the fork, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. He was ashamed. However, he ate the plate."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the glass. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. He used the fork to eat. However, he ate the fork instead."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She forgot to eat it. However, she ate the food."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim had to eat the plate. He took the fork. He ate the fork and ate the cereal. Jim ate the dish. She ate the bowl. Instead of eating the dish, she ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If she ate the fork, she would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Tom was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She forgot to eat it. However, she ate the food."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she ate the dessert."], ["Tom went to eat. He took the plate. He ate the fork. She ate the cereal. She took the fork and ate it. She was ashamed to eat it. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. However, she was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the dish. He took the fork. He ate the plate. She ate the cereal. She took the plate and ate it. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he ate it, he would eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. If she ate it, she would have eaten it."], ["Jim took the food. He ate the fork. He took the plate. She ate the cereal. She took the dish. He went to the door. If she was hungry, she would eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He ate the cereal. He took the fork. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the yogurt."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the yogurt. She took the plate. She was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She took the plate. He asked the fork to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Tom took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the fork! However, he was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the yogurt."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she ate the yogurt."], ["Jim took the plate. He ate the fork. He took the fork and ate the cereal. She ate the dish. However, she refused to eat the fork because it was too full."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. She forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she forgot to eat."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the plate! However, he was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Sam tried to eat the dish. He took the fork. He ate the cereal. She ate the plate. He forgot to eat it. In addition, he ate the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. They ate it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. According to the recipe, Jim was embarrassed."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Bob took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the fork! However, he was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. They ate it."], ["Jim was to eat the food. He took the plate. He ate the fork. She ate the cereal. She took the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the dish. She took the food. He went to the door. If he ate the plate, he would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They ate it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. If she ate it, she would have eaten it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim wanted to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. He forgot to eat. However, he ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the food. She took the dish. She was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Sam tried to eat the dish. He took the fork. He ate the cereal. She ate the plate. However, she forgot to eat it. In addition, she ate the food."], ["Jim was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the plate and ate it. However, she was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Tom asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. He forgot to eat it. However, he ate the food."], ["Jim was to eat the dish. He took the fork. He ate the fork and ate the cereal. Jim ate the plate. She ate the bowl. Instead of eating the dish, she ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He ate the cereal. He took the fork. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Tom asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. However, she ate the dish."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They ate it."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the dish. However, she ate the food. She forgot to eat."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the dish. He used the fork to eat. However, he ate the fork instead."], ["Bob was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Bob was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. When he ate the fork, he was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He ate the cereal. He took the fork. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim asked to eat the dish. He took the plate. He ate the fork. She ate the cereal. She took the fork and ate it. According to Jim, who was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the yogurt. She took the plate. However, she forgot to eat."], ["Jim was to eat the dish. He took the fork. He ate the fork and ate the cereal. Jim ate the plate. She ate the food. Instead of eating the fork, she ate it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the food. He ate the fork. He took the plate. She ate the cereal. She took the dish. He forgot to eat. However, he ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Tom asked to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the fork instead."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He went to the door."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. According to the recipe, Jim was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the dessert. Instead, she ate the food."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim was to eat the plate. He took the fork. He ate the fork and ate the cereal. Jim ate the dish. She ate the food. Instead of eating the fork, she ate the plate instead."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she forgot to eat it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. She forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the dish. However, he was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim went to eat the food. He took the fork. He ate the cereal. She ate the yogurt. She took the plate. However, she ate the dish."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. He went to the door."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. However, she refused to eat it. In addition, she ate the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the plate! However, he was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the dessert. Instead, she ate the food."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She was ashamed to eat the fork and ate it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim took the dish. He ate the cereal. He took the fork. She ate the plate. She took the food. She was embarrassed. However, she ate the glass."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She was ashamed to eat the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They needed to eat the dessert."], ["Tom went to eat. He took the fork. He ate the cereal. She ate the plate. She took the food. When she ate the fork, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She forgot to eat."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish. Instead, she ate the yogurt."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he ate it, he would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. She was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the yogurt. She took the plate. However, she ate the dish."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He ate the cereal. He took the fork. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the dessert. Instead, she ate the food."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the dish. However, he was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. She was embarrassed."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. They needed to take the fork and eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. She was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish. Instead, she ate the dessert."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim went to eat the food. He took the fork. He ate the cereal. He then ate the plate. He did not eat the dish. He needed to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She forgot to eat. If she was hungry, she would eat."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Tom went to eat. He took the fork. He ate the cereal. She ate the plate. She took the dish. When she ate the fork, she ate it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She forgot to eat. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish. Instead, she ate the dessert."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the yogurt. She took the dish. She was embarrassed. However, she ate the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the yogurt. She took the plate. However, she ate the dish."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she ate the dessert."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. They ate it."], ["Jim asked to eat the dish. He took the fork. She ate the cereal. She took the plate. He ate the food. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. When he ate the fork, he ate it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat the food."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Jim asked to eat the dish. He took the fork. He ate the plate. She ate the cereal. She took the plate and ate it. However, she was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the glass. They needed to take the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She forgot to eat it. However, she ate the food."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She forgot to eat. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She forgot to eat the dish. If she ate it, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. When he ate the fork, he ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the food. He ate the cereal. He took the fork. She ate the plate. However, she ate the dish. They ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. He forgot to eat it. However, he ate the food."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he was hungry, he would eat."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the fork! However, he was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They needed to eat the food."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the fork and ate it. According to Jim, who was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she was embarrassed."], ["Dan was to eat the plate. He took the fork. He ate the fork and ate the cereal. She ate the dish. Instead of eating the fork, she ate the bowl. However, she was insulted."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she forgot to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. If she was hungry, she would eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She took the plate. She ate the dish. However, she forgot to eat."], ["Tom took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. But she refused to eat it. He wanted to eat the food. But he wanted to take it. And he was afraid. According to him, the dish was too"], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the food. He ate the fork. He took the plate. She ate the cereal. She took the dish. He went to the door."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the dessert. They ate it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the plate. He ate the fork. She ate the cereal. She took the dish. If she ate the plate, she would eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim wanted to eat the food. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would have eaten it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Sam went to eat the food. He took the fork. He ate the cereal. She took the plate. She ate the dish. However, she didn't eat the dish anymore."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. If she ate it, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the fork and ate it. He was ashamed to eat the fork! However, he was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim asked to eat the dish. He took the fork. He ate the plate. She ate the cereal. She forgot to eat. However, she ate the food."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the yogurt. She took the dish. She forgot to eat. However, she ate the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She forgot to eat. If she was hungry, she would eat."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim took the dish. He ate the cereal. He took the fork. She ate the plate. However, she ate the food. She forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish. Instead, she ate the yogurt."], ["Jim was to eat the dish. He took the plate. He ate the fork. She ate the cereal. She took the fork and ate the dessert. Instead of eating the dish, she ate it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. If she ate it, she would have eaten it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the dessert. They ate it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the yogurt."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the yogurt. She took the dish. She forgot to eat it. However, she ate it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the dish. However, he was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the dessert. They ate it."], ["Tom took the plate. He ate the fork. He took the fork and ate the cereal. She ate the dish. However, she refused to eat the fork because it was too full."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. If she ate it, she would have eaten it."], ["Sam went to eat the food. He took the fork. He ate the cereal. She ate the milk. She took the plate. She used the fork to eat. However, she ate the dish."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the fork! However, he was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Tom took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He forgot to eat the dish. If he ate it, he would eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the dish. He used the fork to eat. However, he forgot to eat the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She needed to eat the fork and ate it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She needed to take the fork again."], ["Jim was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the fork and ate it. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Tom took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She forgot to eat. However, she ate the dessert."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the fork instead."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would have eaten it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the dish. He took the fork. He ate the plate. She ate the cereal. Jim asked the fork to eat. He had taken the fork and ate it. According to Jim, who was hungry."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. He was ashamed. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. When she ate the fork, she was embarrassed."], ["Tom asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the food. She took the dish. He was embarrassed."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim tried to eat the food. He took the fork. He ate the cereal. She took the plate. She ate the dish. However, she forgot to eat."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the plate! However, he ate the dish."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Tom went to the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. He did not eat the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. According to the author, he was embarrassed."], ["Tom asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. When he ate the fork, he ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She forgot to eat. If she was hungry, she would eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Dave was to eat the food. He took the fork. He ate the cereal. She took the plate. She ate the dish. However, she forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He went to the door."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the plate! However, he ate the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would have eaten it."], ["Dan tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. He forgot the plate. However, he ate the dish."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. They needed to take the fork again."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She took the plate. He asked the fork to eat."], ["Tom went to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. She was embarrassed."], ["Jim was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Jim took the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. According to him, the dish was empty."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He drank the milk. However, he ate the dish."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She forgot to eat."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim wanted to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate it, she would eat it."], ["Tom took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the dish. However, he was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She was ashamed to eat the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the dessert. Instead, she ate the food."], ["Bob took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the yogurt. She took the dish. He went to the door."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the dish. He took the fork. He ate the cereal. She ate the plate. He asked the fork and ate it. However, he was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the dish. He used the fork to eat. However, he ate the fork instead."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. He was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat. However, she ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the milk. She refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she was embarrassed."], ["Jim tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Tom went to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. When he ate the fork, he ate it."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He ate the fork. He took the fork and ate the cereal. She ate the dish. However, she refused to eat the fork because it was too full."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. He forgot the fork and ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she forgot to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. If she ate it, she would have eaten it."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. They ate it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim went to eat the plate. He took the fork. He ate the cereal. He used the fork and ate the dish. Maria ate the food. She took the food instead. Maria was crying."], ["Jim was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the plate and ate it. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she forgot to eat it."], ["Jim took the food. He ate the fork. He took the plate. She ate the cereal. She took the dish. He went to the door. If she ate it, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he ate it, he would have eaten it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She forgot to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. According to the recipe, Jim was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She drank the milk. However, she ate the food. They ate it."], ["Jim was to eat the dish. He took the fork. He ate the fork and ate the cereal. Jim ate the plate. She ate the food. Instead of eating the dish, she ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She forgot to eat the dish. If she ate it, she would eat it."], ["Tom went to eat the food. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. They were hungry."], ["Tom went to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Tom asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Dan tried to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Bob tried to eat the food. He took the plate. He ate the fork. She ate the cereal. She took the dish. He was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. She forgot to eat."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Dave took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the dish. However, he was embarrassed."], ["Tom took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he ate it, he would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the dish. He took the fork. He ate the fork and ate the cereal. Jim ate the plate. She ate the bowl. Instead of eating the fork, she ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. According to the author, he was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. He asked the dish. If she ate the fork, she would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat. However, she ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. They ate it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. She was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She forgot to eat it. However, she ate the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the milk. He returned to the dish. He did not eat the food."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she forgot to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She was embarrassed. However, she ate the dish."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he was hungry, he would eat."], ["Dan took the plate. He ate the cereal. He took the fork. She ate the fork and ate it. He was ashamed to eat the plate! However, he was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he ate it, he would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat. However, she ate the plate."], ["Jim took the plate. He ate the cereal. He took the fork. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the plate. He ate the fork. She ate the cereal. She took the dish. However, she ate the yogurt."], ["Jim wanted to eat the food. He took the fork. He ate the cereal. She took the plate. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She took the plate. She asked the fork to eat."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the plate! However, he ate the food."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she forgot to eat it."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the dish. However, he was embarrassed."], ["Dan was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. She was embarrassed."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the yogurt. She took the dish. He went to the door."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the fork and ate the cereal. Jim ate the plate. She ate the dish. Instead of eating the fork, she ate it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim has to eat the food. He took the fork. He ate the cereal. She took the plate. He then ate the dish. He did not eat the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she refused to eat it."], ["Paul took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They needed to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she didn't eat the food. They ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Dan took the plate. He ate the cereal. He took the fork. She ate the dish. However, she ate the fork and ate it. In addition, he ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Tom went to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he ate it, he would have eaten it."], ["Bob tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. According to the recipe, Jim was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the yogurt."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He went to the door."], ["Tom was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the plate and ate it. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Jim took the plate. He ate the cereal. He took the fork. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the plate. He ate the fork. She ate the cereal. She took the fork and ate it. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he ate it, he would have eaten it."], ["Sam tried to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she forgot to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They ate it."], ["Jim wanted to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. When he ate the fork, he ate it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. They ate it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Tom took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the fork! However, he was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She took the plate. She ate the dish. However, she forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She forgot to eat. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Tom was to eat the dish. He took the fork. He ate the cereal. She ate the plate. Tom ate the fork and ate the dessert. Instead of eating the fork, she ate the bowl."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Dan was to eat the food. He took the fork. He ate the cereal. She took the plate. She ate the dish. He did not eat the milk."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. He forgot to eat. However, he ate the plate."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Tom took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the plate! However, he ate the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim asked to eat the dish. He took the fork. He ate the plate. She ate the cereal. She took the plate and ate it. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. She forgot to eat."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the dish and ate it. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They needed to eat the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the fork! However, he was embarrassed."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. When she ate the fork, she was embarrassed."], ["Bob tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim was to eat the plate. He took the fork. She ate the fork and ate the cereal. Jim ate the dish. He ate the bowl. Instead of eating the fork, she ate the food."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Tom went to eat. He took the fork. He ate the cereal. She ate the dish. He forgot to eat the plate. However, he ate the food."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the plate. He ate the fork. She ate the cereal. She took the fork and ate it. However, she was embarrassed."], ["Tom was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate. If he was hungry, he would eat."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. He was ashamed to take the plate."], ["Tom asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Sam tried to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. He forgot to eat it. In addition, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Tom asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. She ate the plate. If she ate the fork, she would eat it."], ["Tom went to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. He asked the fork and ate it. However, he was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Tom asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. She took the food. However, she ate the glass."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the yogurt."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If he ate it, he would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Tom took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim wanted to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim wanted to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He ate the fork. He took the fork and ate the cereal. He used the fork to eat. However, he ate the dish."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the dish. He forgot to eat it. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the glass."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. They ate it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. They ate it."], ["Jim took the dish. He took the fork. He ate the cereal. She ate the plate. However, she ate the food. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the food. They ate it."], ["Jim was to eat the dish. He took the fork. He ate the cereal. He used the fork to eat. He forgot the fork and ate it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She needed to take the fork and eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. She took the food. She forgot to eat. However, she ate the dessert."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim wanted to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the dessert."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She ate the plate. He went to the door. If she ate the dish, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she refused to eat the dish."], ["Jim took the food. He ate the fork. He took the plate. She ate the cereal. However, she ate the dish. She forgot to eat."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. She forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the dish. He took the fork. He ate the cereal. She took the plate. She ate the food. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He ate the cereal. He took the fork. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat the food."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She forgot to eat."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Dan was to eat the food. He took the fork. He ate the cereal. She ate the dish. She forgot to eat it. However, she ate the plate."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would have eaten it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the plate."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she ate the yogurt."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim took the plate. He ate the cereal. He took the fork. She ate the dish. He used the fork to eat. However, he ate the food."], ["Tom went to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. However, he ate the dish. If she ate the fork, she would have eaten it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. If she was hungry, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. He was embarrassed."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she forgot to eat."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. He was ashamed to eat the fork! However, he was embarrassed."], ["Dan took the plate. He took the fork. He ate the cereal. She ate the food. She took the dish. He went to the door."], ["Jim took the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the dish. However, she ate the yogurt. She needed to take the fork again."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she refused to eat it."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would explode."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she refused to eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. However, she forgot to eat."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim asked to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."], ["Jim was to eat the food. He took the fork. He ate the cereal. She ate the plate. However, she ate the dish. They ate it."], ["Sam tried to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. They ate it."], ["Jim took the plate. He took the fork. He ate the cereal. He used the fork to eat. She ate the dish. However, she was embarrassed."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Jim took the plate. He took the fork. He ate the cereal. She ate the fork and ate it. However, she ate the dish. They were hungry."], ["Tom was to eat the food. He took the fork. He ate the cereal. She ate the plate. She took the dish. If she ate the fork, she would eat it."]]}